---
kind: type
id: T:Autodesk.Revit.DB.AnnotationSymbolType
source: html/a8a53b66-bf87-7441-bf02-497d39fd011a.htm
---
# Autodesk.Revit.DB.AnnotationSymbolType

An object that represents an annotation style.

## Syntax (C#)
```csharp
public class AnnotationSymbolType : FamilySymbol
```